<a href="https://colab.research.google.com/github/gzawadzki/pandas_exercises_guisamora/blob/main/05_Merge.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [ ]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [ ]:
s1 = pd.Series([np.random.randint(1,5)]*100)

In [ ]:
s2 = pd.Series([np.random.randint(1,4)]*100)

In [ ]:
s3 = pd.Series([np.random.randint(10_000,30_001)]*100)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [ ]:
df_merged = pd.concat([s1, s2, s3], axis=1)
df_merged

    0  1      2
0   1  2  15201
1   1  2  15201
2   1  2  15201
3   1  2  15201
4   1  2  15201
.. .. ..    ...
95  1  2  15201
96  1  2  15201
97  1  2  15201
98  1  2  15201
99  1  2  15201

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [ ]:
df_merged.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df_merged

    bedrs  bathrs  price_sqr_meter
0       1       2            15201
1       1       2            15201
2       1       2            15201
3       1       2            15201
4       1       2            15201
..    ...     ...              ...
95      1       2            15201
96      1       2            15201
97      1       2            15201
98      1       2            15201
99      1       2            15201

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [ ]:
df2 = pd.concat([s1, s2, s3], axis=0).to_frame()
df2

        0
0       1
1       1
2       1
3       1
4       1
..    ...
95  15201
96  15201
97  15201
98  15201
99  15201

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [ ]:
df2.reset_index(drop=True, inplace=True)    
df2

         0
0        1
1        1
2        1
3        1
4        1
..     ...
295  15201
296  15201
297  15201
298  15201
299  15201

[300 rows x 1 columns]